Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: དེ་ཚེ་བདུད་ནི་སྡིག་ཅན་དེ་ཡིས་སུ། ཤིན་ཏུ་མི་བཟད་རྣམ་པས་གཙེས་བྱས་ཀྱང་། །བརྩོན་འགྲུས་དཔག་མེད་སྟོབས་ནི་བསྐྱེད་ནས་སུ། །བདུད་སྟོབས་སྟེན་པ་བྱང་ཆུབ་རྟོགས་པར་ཆུད། །
en: Then the evil Māra took on A terrifying appearance and made threats. “But arousing his limitless power of perseverance, He withstood the force of the demons and realized awakening.

source: རང་བྱུང་གིས་ནི་བདུད་སྡེ་སྤ་བཀོང་ཞིང་། །ལྗོན་མཆོག་དྲུང་དུ་སྐྱིལ་མོ་དབྱེར་མེད་བཅས། །སྤུན་པ་རླུང་གིས་ཕྱར་ལྟར་བཅོམ་ནས་སུ། །བྱང་ཆུབ་མཆོག་རེག་སྐྱེ་དགུ་ཐུགས་སུ་ཆུད། །
en: The Self-Manifest One intimidated the demon horde And sat cross-legged at the base of the supreme tree without leaving. “Like chaff carried off by the wind, he vanquished them, And reached supreme awakening, understanding all lives.

source: དེ་ཚེ་ས་ནི་རྣམ་དྲུག་རབ་གཡོས་ཤིང་། །བསྙེན་པར་དཀའ་བའི་སྡེ་དེ་ཕྱོགས་འཚོལ་ཏོ། །
en: Then the earth shook in six ways. The menacing hordes looked for safety,

source: རླུང་གི་རྒྱལ་པོས་བྱ་ནི་ཁྱེར་བ་ལྟར། །བདེ་བར་གཤེགས་པའི་གཟི་ཡིས་རྣམ་པར་བཅོམ། །
en: “Like birds carried off by a storm, Conquered by the Blissful One’s brilliance.

source: ཀླུ་དང་གནོད་སྦྱིན་སྲིན་པོ་དེ་དག་གིས། །དེ་ཚེ་སྣ་ཚོགས་གདོང་ནི་མངོན་པར་སྤྲུལ། །དེ་དག་བདུད་བསྟེན་པ་ཡི་གཟི་བརྗིད་ཀྱིས། །ཁ་ན་བྱེད་པ་ཡོད་པ་དེ་དག་བཅོམ། །
en: Then the variety of faces manifested By those nāgas, yakṣas, and rākṣasas— “All the sounds they made with their mouths Were all destroyed by the brilliance of the power of User of Evil.

source: ཇི་ལྟར་ང་ཡིས་བདུད་ཀྱི་བུ་མོ་བཅོམ། །བུད་མེད་འདི་དག་བདག་གིས་དེར་རྒས་ནས། །
en: As I was able to vanquish the demonic maidens, I also made the maidens become old.

source: དེ་བཞིན་བདུད་སྟོབས་བསྙེན་དཀའ་རང་གིས་སྤྲུལ། །བདུད་སྟོབས་བསྟེན་པའི་མཐུ་ཡིས་བཅོམ་པར་གྱུར། །
en: “In that way the Obstinate Force of Evil, manifested on his own, Was conquered by the power of User of Evil.

source: བདེ་གཤེགས་མཆོག་ལ་ལྷ་ཡིས་བུ་སྤྲུལ་བཀང་། །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པས་ཟིལ་གྱིས་མནན། །
en: The barrage of emanations the god sent at the supreme Blissful One Was overpowered by the Guide of the World.

source: ལྷ་ཡི་བུ་མོ་ཁྲི་ཕྲག་བརྒྱད་ཅུ་ཀུན། །བདུད་བསྟེན་པས་ནི་བྱང་ཆུབ་དག་ལ་བཙུད། །
en: “User of Evil led to awakening All eight hundred thousand divine maidens;

source: རྣམ་པར་བཏུལ་ཅིང་བྱང་ཆུབ་མི་གཡོ་གནས། །
en: Tamed, they remained unwavering in awakening.

source: དེ་ཚེ་བསྙེན་པར་དཀའ་བ་སྡུག་བསྔལ་གྱུར། །
en: Then the troublemakers felt in pain,

source: དེ་ཡི་ཚེ་ན་བདུད་བསྟེན་བྱུང་ནས་སུ། །འགྲོ་བ་དེ་དག་བདག་གིས་གྲོལ་བར་བྱས། །
en: “Until User of Evil appeared and said, ‘I will liberate these beings.

source: དེ་ལྟར་ང་ཡིས་བརྩོན་འགྲུས་བསྐྱེད་པས་སུ། །དེ་ཚེ་ཐུབ་པར་དཀའ་བའི་བདུད་ལས་རྒྱལ། །
en: So, I will muster diligence And conquer these obstinate demons.

source: རྡུལ་བྲལ་ཞི་མཆོག་བྱང་ཆུབ་ཚོལ་བ་ན། །ང་ཡི་སྲས་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱ། །
en: “ ‘Having pursued the immaculate, supreme peace of awakening, My descendants will train in the same way.

source: སེམས་ཅན་བྱེ་བ་མང་པོའི་དོན་བྱ་ཞིང་། །ནམས་ཀྱང་བདག་གི་ཕྱིར་ནི་བདེ་མི་བྱ། །
en: I will strive for many millions of beings And never for happiness for myself.

source: ཇི་ལྟར་མགོ་ལ་མེ་འབར་གཞན་མི་སེམས། །སྐྱེས་བུས་ཞི་བྱ་ལྟ་བུར་བརྩོན་འགྲུས་བསྐྱེད། །
en: “ ‘With no other thought, like someone whose hair is on fire Strives to put it out, I shall persevere.

source: དེ་ལྟར་ཞི་བ་མཆོག་དག་ཚོལ་བ་ན། །ཡིད་ཀྱིས་ཡིད་ཀྱིས་རྣམ་པར་བསམ་པར་བྱོས། །
en: Thus in pursuit of supreme peace, Put your thoughts to this!’ ”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཟླ་བ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ། །
en: Then the nāga king Mahācandra asked the Blessed One in the form of a song in verse:

source: མི་དང་ལྷ་ཡི་སྟོན་པ་ཁ་ལོ་སྒྱུར། །ལྷ་དང་བཅས་པ་འགྲོ་འདིའི་འདྲེན་པ་སྟེ། །ཇི་ལྟར་བདེ་གཤེགས་བདག་འཁྲུངས་དྲན་ལྡན་པ། །བླ་མེད་བྱང་ཆུབ་ཐོབ་པ་བདག་གིས་ཞུ། །
en: “Helmsman and Teacher of humans and gods, Guide of all beings including the gods, I ask you: how did the Blissful One, Self-born and mindful, attain unsurpassed awakening?”

source: འདྲེན་པ་ཐུབ་པས་འདིར་ནི་སྲིད་ལས་རྒྱལ། །ཇི་ལྟར་འདྲེན་པ་བདེ་གཤེགས་བདག་ལ་འཁྲུངས། །བདུད་ནི་རྨོངས་མཛད་མྱ་ངན་འདས་རེག་པ། །རྒྱལ་བ་གང་ཟག་མཆོག་གིས་ལུང་བསྟན་པ། །
en: The sagacious guide who has conquered existence, The Victor and supreme person, explained How the self-born Guide, the Blissful One, Tricked Māra and reached nirvāṇa:

source: དྲན་པ་ཉེ་བར་གཞག་ལ་དྲན་བསྡམས་ན། །ཉེས་བཅས་འཁོར་བའི་འགྲོ་བ་འགག་པར་འགྱུར། །
en: “If you remain mindful of the applications of mindfulness, Unwholesome migration in cyclic existence will cease.

source: སྐྱེ་བོ་མི་མཁས་གང་ལ་ཆགས་གྱུར་པ། །བདེ་བ་རབ་ཏུ་མི་ཤེས་སྡུག་བསྔལ་རེག །
en: Whatever ignorant beings become attached to, They experience no happiness and instead meet pain.

source: དྲན་པ་ཉམས་པ་འཁོར་བ་དེ་དང་དེར། །མི་མཁས་འཁོར་བའི་སྡུག་བསྔལ་རྗེས་སུ་དྲན། །
en: “I brought to mind the suffering in cyclic existence Of the unmindful who lack understanding of cyclic existence;

source: རྨོངས་པ་དེ་ནི་ཐར་བའི་འགྲོ་མི་ཤེས། །ཉོན་མོངས་བདུད་ཀྱི་སྤྱོད་ཡུལ་དག་ལ་དགའ། །
en: Confused, they do not know the way to liberation, And take pleasure in the realm of affliction and evil.

source: ལོག་པ་རྣམ་པར་ཉམས་པའི་ཡིད་ཀྱིས་སུ། །མི་རྟག་རྟག་དང་སྡུག་བསྔལ་བདེ་བ་དང་། །བདག་མེད་བདག་དང་མི་གཙང་གཙང་འཛིན་པ། །ཉོན་མོངས་བདུད་ཀྱི་ཡུལ་ལས་མི་འགྲོལ་ལོ། །
en: “In their wrong, misguided state of mind, They take the impermanent to be permanent, suffering to be pleasure, That which lacks a self to have one, and the impure to be pure. They are never free from the realm of affliction and evil.

source: རབ་ཉམས་དེ་དག་གིས་ནི་འགྲོ་བ་ཤེས། །
en: “Recognizing how they migrate because of their errors, And

source: དྲན་པ་ཉེར་གཞག་ལམ་ནི་རབ་ཏུ་ཤེས། །
en: understanding the path of the applications of mindfulness,

source: སྤྱད་པ་སྤྱོད་ཚེ་འགྲོ་ལ་ཕན་པའི་ཕྱིར། །བྱང་ཆུབ་བྱེད་པའི་དྲན་པ་ཉེ་བར་གཞག །
en: When I was training, for the sake of beings, I applied mindfulness to becoming awakened.”

source: དྲན་པ་ཉེ་བར་གཞག་པ་ཀླུས་ཐོས་ནས། །བྱང་ཆུབ་གཞལ་དུ་མེད་ལ་འདུན་པ་བསྐྱེད། །
en: When the nāga heard about the application of mindfulness, He felt yearning for immeasurable awakening.

source: ཀླུ་ཆེན་ཟླ་བས་མི་འདུལ་ཁ་ལོ་སྒྱུར། །དྲན་པ་ཉེ་བར་གཞག་པ་རྒྱལ་ལ་བསྟོད། །
en: The nāga Mahācandra then praised the helmsman of the untamed, The Victor who applied mindfulness:

source: དྲན་པ་ཉམས་པའི་འགྲོ་བ་འདྲེན་པ་ལགས། །དྲན་སྟོབས་ཤིན་ཏུ་གནས་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to the guide of unmindful beings, The one who abides by the power of mindfulness!

source: བྱང་ཆུབ་གཞལ་དུ་མེད་པར་འདུན་པ་བསྐྱེད། །དྲན་པ་ཉམས་པ་མེད་པའི་འགྲོ་བ་བསྟན། །
en: Having felt yearning for immeasurable awakening, He has taught the way to unwaning mindfulness.

source: བྱང་ཆུབ་གཞལ་དུ་མེད་ལ་འདུན་པ་བསྐྱེད། །བྱང་ཆུབ་དྲན་ལྡན་གནས་ལ་རེག་པར་བགྱི། །
en: “Having felt yearning for immeasurable awakening, I will reach the abode of mindful awakening.

source: བདུད་སྟོབས་བདུད་དཔུང་བཅས་གཞོམ་སྤང་བྱ་ཞིང་། །
en: I will vanquish and forsake the force of evil and the legions of evil.

source: བདུད་ཀྱིས་དམ་དུ་བཅིངས་པའི་སེམས་ཅན་དགྲོལ། །
en: I will liberate beings bound tightly by evil.”

source: རྒྱལ་བ་དྲན་པ་ཉེ་བར་གཞག་པ་མཁྱེན། །ཀླུ་དེའི་བསམ་པ་ཐུགས་སུ་ཆུད་ནས་སུ། །
en: With his wisdom of applying mindfulness, The Victor was aware of what the nāga was thinking.

source: སེམས་ཅན་ཕན་ཕྱིར་ཀླུ་ཆེན་ཟླ་བ་ནི། །འདྲེན་པས་གཞལ་མེད་བྱང་ཆུབ་ལུང་བསྟན་པ། །
en: In order to benefit beings, the Guide prophesied The nāga Mahācandra’s unfathomable awakening:

source: སྔོན་གྱི་སངས་རྒྱས་བྱེ་བ་བརྒྱད་ཅུ་ལ། །ཀླུ་བདག་དེ་ཡིས་སྔོན་ནི་བསྙེན་བཀུར་བྱས། །
en: “O nāga lord, in the past you served Eight hundred million previous buddhas.

source: འདི་ནས་ཕྱིས་ནི་སངས་རྒྱས་བྱེ་བ་བཅུ། །བྱང་ཆུབ་ཞི་བ་ཚོལ་ཚེ་མཆོད་པ་བྱེད། །
en: In the future you will serve one hundred million buddhas In pursuit of the peace of awakening.

source: ཕྱི་ནས་དེ་ནི་གཞལ་མེད་བྱང་ཆུབ་རེག །
en: “Eventually you will reach unfathomable awakening.

source: རྒྱལ་བའི་མཚན་ནི་ཟླ་བཟང་ཞེས་བྱ་སྟེ། །
en: Your name as a victor will be Sublime Moon.

source: བདུད་ཀྱི་སྟོབས་ནི་ཤིན་ཏུ་སྟོབས་ཉམས་བྱེད། །བདུད་ཀྱི་སྟོབས་ནི་རྒྱལ་བའི་སྟོབས་བྱེད་འགྱུར། །
en: You will weaken the force of evil immensely, And transmute the force of evil into the way of the victors.”

source: སངས་རྒྱས་ཀྱིས་ནི་ལེགས་གསུངས་འདི་ཐོས་ནས། །
en: When they heard the Buddha’s marvelous words,

source: ཀླུ་ནི་བྱེ་བ་བྱང་ཆུབ་མཆོག་ལ་གནས། །སྔོན་མེད་བྱང་ཆུབ་ལ་ནི་ཡིད་ཞུགས་ཏེ། །
en: Ten million nāgas were introduced to supreme awakening, Penetrating awakening with their minds as never before.

source: སངས་རྒྱས་ལེགས་པར་གསུངས་ལའང་མངོན་པར་དགའ། །
en: They delighted in the Buddha’s marvelous speech.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཚོགས་བྱེད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ། །
en: Then the nāga king Gatherer asked the Blessed One in the form of a song in verse:

source: རྒྱལ་བ་ཉིད་འཁྲུངས་ཡང་དག་འདུ་གྱུར་པ། །མ་འཁྲུལ་སེམས་ཀྱིས་སྤྱད་པ་སྤྱོད་པ་ན། །བདུད་ཀྱི་སྟོབས་བཅས་དཔུང་བཅས་བཅོམ་ནས་སུ། །བླ་མེད་བྱང་ཆུབ་ཞི་བ་ཇི་ལྟར་འཐོབ། །
en: “Victor who took birth, How can one practice with mind undeluded To conquer the force and legions of Māra, And achieve the peace of unexcelled awakening?”

source: བདེ་བའི་སེམས་ནི་གཡོ་བར་མི་བྱ་ཞིང་། །ཉོན་མོངས་བདུད་ཀྱིས་སྟོབས་ནི་རྣམ་པར་སྤང་། །
en: “Never waver from a happy attitude, Forsake afflictions and the force of Māra, And

source: མཉམ་གཞག་རྒྱལ་བའི་སྤྱད་པ་སྤྱོད་བྱེད་པ། །དེ་ནི་མྱུར་དུ་བྱང་ཆུབ་ཞི་འཐོབ་འགྱུར། །
en: carry out the practice of the victors, resting in equanimity— Then will you swiftly achieve the peace of awakening.”

source: ལུང་བསྟན་པས་ནི་ཀླུ་དེ་དག་འགྱུར་ནས། །རྒྱལ་བའི་བྱང་ཆུབ་ལ་ནི་ཡིད་འཇུག་ཅིང་། །མཉམ་གཞག་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལས་ནི་འབྱུང་། །འདྲེན་ལ་བསམ་གཏན་ཚུལ་གྱིས་མངོན་བསྟོད་པ། །
en: The nāga was delighted with this answer, Set his resolve on the awakened state of the victors, Escaped from the realm of Māra in equanimity, And praised the Guide in terms of concentration:

source: སྤྱོད་ཡུལ་དང་ནི་སྤྱོད་ཡུལ་མ་ཡིན་མཁྱེན། །
en: “You know the proper from the improper domain.

source: གང་དག་འཇིག་རྟེན་འདྲེན་པ་ཁྱོད་ཀྱིས་བསླབས། །འགྲོ་བ་དེ་དག་བདུད་ཀྱི་ཡུལ་ལས་ཐར། །
en: Anyone you teach, O Guide of the World, Becomes free from the domain of Māra.

source: ཆགས་མེད་ཐུགས་ཀྱིས་དགོངས་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to you whose mind is free from attachment!

source: དེ་རིང་སླན་ཆད་རྒྱལ་བའི་སྤྱོད་ཡུལ་ལ། །སྤྱད་པར་བགྱི་ཞིང་བདུད་ཀྱི་སྤྱོད་ཡུལ་སྤང་། །
en: “From this day forward, I will engage in the domain Of the victors and forsake the domain of Māra.

source: བདུད་ཀྱི་སྤྱོད་ཡུལ་ལས་ནི་འགྲོ་བ་དགྲོལ། །བདེ་གཤེགས་སྤྱོད་ཡུལ་ལ་ནི་ཡང་དག་དགོད། །
en: I will liberate beings from the domain of Māra, And lead them to the domain of the Blissful.”

source: གང་ཟག་མཆོག་གིས་ཀླུ་ཡི་བདག་པོ་ཡི། །བསམ་པ་མཁྱེན་ནས་བྱང་ཆུབ་ལུང་བསྟན་པ། །
en: Aware of the nāga lord’s thoughts, The supreme person prophesied his awakening,

source: གང་དག་ཉོན་མོངས་བདུད་ཀྱི་ཡུལ་ལ་བརྟེན། །བྱེ་བ་ཐམ་པའི་ཀླུ་ནི་ཡང་དག་གནས། །
en: And a full ten million nāgas involved with affliction And the domain of Māra reached the state of full abiding.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཤུགས་འཆང་གིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Power Wielder asked the Blessed One in the form of a song in verse:

source: མི་དག་འདི་རུ་ཤེས་རབ་ལ་སྤྱོད་པ། །འདོད་ལ་ཆགས་མེད་སྤྱད་པ་སྤྱོད་པའི་ཚེ། །བདུད་ཀྱི་སྟོབས་བཅུས་དཔུང་བཅས་བཅོམ་ནས་སུ། །བྱང་ཆུབ་གཞལ་མེད་ཉེས་མེད་ཇི་ལྟར་འཐོབ། །
en: “How can people who train in insight Practice non-attachment to sense pleasures, To vanquish Māra’s ten powers and his legions, And achieve unfathomable, flawless awakening?”

source: འགྲོ་ཀུན་སྒྱུ་མ་འདྲ་བར་སུས་ཤེས་པ། །དེ་ནི་བདུད་ཀྱི་ཞགས་པས་འཆིང་མི་བྱེད། །
en: “Those who know that everyone is illusory Are no longer bound by the ropes of evil. Yet

source: འགྲོ་བ་འདི་དག་བདུད་ཀྱིས་བཅིངས་མཐོང་ནས། །སྙིང་རྗེ་བསྐྱེད་དེ་དཀའ་ཐུབ་མཆོག་ལ་སྤྱོད། །
en: seeing beings still bound by Māra, They feel compassion and engage in the supreme austerities.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །
en: Hearing the Teacher’s words, the nāga was delighted,

source: གཞལ་དུ་མེད་པའི་དགའ་བས་སེམས་རངས་ཏེ། །རྒྱལ་བ་ཐུབ་ལ་མཁྱེན་པས་བསྟོད་ནས་སུ། །བྱང་ཆུབ་གཞོལ་བ་ལ་ནི་ཡིད་བསྐྱོད་དོ། །
en: His mind elated with immeasurable joy. He praised the Victor for his wisdom, And roused his mind to strive for awakening.

source: ཀླུ་ཡི་བདག་པོའི་བསམ་པ་ཐུགས་ཆུད་ནས། །འདྲེན་པས་བྱང་ཆུབ་མཆོག་ལ་ལུང་བསྟན་ཏོ། །
en: Aware of the nāga lord’s thoughts, The Guide prophesied his supreme awakening.

source: ཀླུ་ནི་བྱེ་བ་བྱང་ཆུབ་མཆོག་ལ་གནས། །འཇིག་རྟེན་མཁས་པས་བྱང་ཆུབ་དེ་ལུང་བསྟན། །
en: Ten million nāgas set themselves on supreme awakening, And the Knower of the World prophesied them all to awaken.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Sūryagarbha asked the Blessed One in the form of a song in verse:

source: འདྲེན་པ་ཐབས་ལ་མཁས་པ་བདག་ལ་གསུངས། །
en: “O skilled Guide, please tell me—

source: ཐབས་གང་གིས་ནི་སྤྱོད་པ་སྤྱད་བགྱིས་ན། །བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ལས་མི་ལྡོག །
en: What method can a bodhisattva Employ in practice to not regress from awakening?

source: མི་མཆོག་འདི་དག་བདག་ལ་བཀའ་སྩོལ་ཅིག །
en: Foremost of humans, please explain this to me!

source: ཇི་ལྟར་ཡིད་ནི་རབ་ཏུ་མི་ལྡོག་པ། །བདེ་གཤེགས་གང་ཟག་མཆོག་ནི་ཁྱོད་ལས་སུ། །གང་དག་ཐོས་ནས་ཐབས་མཁས་མཉམ་པར་རྩོམ། །སྤྱད་པ་སྤྱོད་པ་རྣམས་ནི་སྐྱོ་མི་འགྱུར། །
en: “O Blissful One, supreme person, when people Hear from you how to keep their mind from regressing, They will venture to become skilled in methods, And will carry out their practice undauntedly.”

source: འགྲོ་བ་མི་མཁས་ལམ་ངན་ཞུགས་པ་ཡི། །འགྲོ་བ་རྣམ་པར་ཉམས་ལ་སྙིང་རྗེ་བསྐྱེད། །
en: “Have compassion for ignorant beings Who are degenerate and enter onto bad paths;

source: འགྲོ་ལ་ཕན་ཕྱིར་རྫོགས་པའི་སངས་རྒྱས་ཆོས། །བདག་ཉིད་ཡོངས་སུ་བཏང་སྟེ་ཚོལ་བར་བྱེད། །
en: Exert yourself, for the sake of beings, In the teaching of the perfect Buddha, forsaking the self.

source: ཆོས་རྣམས་ཀྱི་ནི་ངོ་བོ་ཤེས་པ་ན། །བདག་ཉིད་གཏོང་ལ་ཞུམ་པར་མི་འགྱུར་རོ། །
en: “When you understand the identity of things, You will forsake the self and become undaunted.

source: ཆོས་ནི་གཡོ་བ་མེད་པར་ཤེས་པ་ན། །དེ་བཞིན་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་སྟོན། །
en: When you know phenomena to be unmoving, You can teach that understanding to others.

source: ཆུང་མ་བུ་དང་བུ་མོ་བདག་ཉིད་ཀྱི། །མགོ་ཡང་ཡོངས་སུ་གཏོང་ལ་མི་ཞུམ་མོ། །
en: “Do not be afraid or apprehensive To relinquish your wife, sons, or daughters.

source: དེ་ནི་གང་དུའང་གནས་པར་མི་འཇུག་སྟེ། །བདག་མེད་འདུ་ཤེས་ཀྱིས་ནི་ཡིད་ལ་གནས། །
en: Then, without dwelling on anything, You will abide by the perception of the absence of self.

source: དེ་ནི་ཕུང་པོ་བདག་མེད་རབ་ཏུ་སྟོན། །ཟང་ཟིང་མེད་པའི་བདེ་བའི་མཆོག་འཐོབ་བོ། །
en: “Revealing the absence of self in the aggregates, You will attain sublime happiness, which is transcendent.”

source: དེ་ཚེ་སེམས་ཅན་བྱེ་བ་དཔག་མེད་དག །སྨིན་པར་བྱེད་ལ་དགའ་ཞིང་ཞུམ་པ་མེད། །
en: At that moment innumerable tens of millions of beings Came to maturity, feeling joyful and dauntless.

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་མགུ་གྱུར་ནས། །སངས་རྒྱས་ལ་ནི་སྙིང་ནས་སྐྱབས་སོང་ཞིང་། །བྱང་ཆུབ་གཞོལ་ལ་ཡིད་ནི་བསྐྱེད་པ་དང་། །འཇིག་རྟེན་མཁས་པས་བྱང་ཆུབ་དེ་ལུང་བསྟན། །
en: Overjoyed by the Teacher’s words, the nāga Took refuge in the Buddha sincerely, Formed the resolve in his heart for awakening, And the Knower of the World prophesied his awakening.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་གཟུང་བར་དཀའ་བས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Ungraspable asked the Blessed One in the form of a song in verse:

source: བདེ་གཤེགས་ཁྱོད་སྲས་ཇི་ལྟར་སྤྱད་བགྱིས་ནསངས་རྒྱས་བྱང་ཆུབ་བདེ་བས་སྒྲུབ་པར་བགྱིད། །
en: “Blissful One, how should your child practice To easily achieve awakening to buddhahood?

source: ཇི་ལྟར་ཐུབ་པ་གཤེགས་ལྟར་མྱུར་དུ་མཆི། །དཔག་མེད་གཤེགས་པ་དེ་དག་བདག་ལ་གསུངས། །
en: Please tell me how to advance to the unfathomable Just as the Sage swiftly did.”

source: རྒྱལ་བ་མི་མཆོག་རང་བྱུང་མཁྱེན་པས་སུ། །བྱང་ཆུབ་ངེས་ལ་དེ་ནི་ལུང་བསྟན་པ། །
en: The Victor and foremost human, definitively awakened By means of his self-manifest wisdom, replied,

source: ཇི་ལྟར་རིགས་སུ་བྱང་ཆུབ་སྤྱོད་པ་ན། །ནམས་ཀྱང་འགྲོ་བའི་སྡུག་བསྔལ་རྣམས་མི་རེག །
en: “If you practice for awakening properly, You will never meet with the suffering of beings.

source: བྱམས་པའི་སྟོབས་ཀྱིས་ཕན་པར་སྤྱོད་པ་ན། །བྱམས་པའི་སེམས་ནི་གར་ཡང་མི་རྨོངས་སོ། །
en: “If you act altruistically out of love, no matter where you are, Your loving attitude will never be bewildered.

source: བྱམས་པ་ལ་ནི་སྡུག་བསྔལ་མི་འབྱུང་ཞིང་། །ཉེས་པ་རབ་ཞི་སྤྱོད་པ་མི་གཡོའོ། །
en: In love, no suffering will occur, And you will not waver from the practice of subduing faults.

source: སྤྱོད་ཚེ་སེམས་ཅན་ཀུན་ལ་རབ་ཏུ་སྟོན། །
en: “As you practice, you will also teach all beings:

source: བྱམས་པ་སྒོམས་ཤིག་གར་ཡང་མ་གཡོ་ཤིག །
en: ‘Cultivate love!’ ‘Don’t be distracted!’

source: རབ་ཏུ་ཞི་བའི་ཡིད་ཀྱིས་ཉེས་པ་ཆོམ། །
en: ‘Conquer your faults with a tranquil mind!’

source: སེམས་ཅན་རྣམས་ལ་ཕན་ཕྱིར་ཞི་བ་བཙལ། །
en: You will pursue tranquility to help sentient beings.

source: དེ་ཡིས་ལེགས་པའི་ལས་དེ་བྱས་པས་ན། །སྤྱད་པ་སྤྱོད་ཚེ་སྡུག་བསྔལ་མི་འཐོབ་ཅིང་། །
en: “Engaging in wholesome actions, As you carry out your training, you will not suffer.

source: གཞལ་མེད་བྱང་ཆུབ་མྱུར་དུ་གསོ་བར་བྱེད། །
en: You will swiftly reach boundless awakening, And

source: དེ་ཡི་འཁོར་ནི་ཐམས་ཅད་འཐུན་པར་འགྱུར། །
en: your whole following will be in harmony.”

source: སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །ཤིན་ཏུ་ཞི་བའི་ཡིད་ཀྱིས་ཉེས་པ་སྤངས། །བྱམས་པའི་སེམས་ཀྱིས་ཉེས་པ་རྣམ་པར་བཏུལ། །བྱང་ཆུབ་གཞོལ་བ་ལ་ནི་ཡིད་བསྐྱེད་དོ། །
en: Delighted by the Teacher’s words, The nāga gave up wrongdoing with a tranquil mind, Subdued wrongdoing with love in his heart, And formed the resolve to awaken.

source: རྒྱལ་བ་སྔ་ཕྱི་མཁས་པས་དེའི་བསམ་པ། །རབ་ཏུ་དང་བའི་ཡིད་ཀྱིས་ཉོན་མོངས་བཏུལ། །ཡོངས་སུ་དག་ལ་ཤིན་ཏུ་གནས་མཁྱེན་ནས། །བྱང་ཆུབ་མཆོག་ལ་ཀླུ་ནི་ལུང་བསྟན་པ། །
en: The Victor, who knew the past and future, was aware Of his thoughts—how he had tamed his afflictions with pure intention And utterly established himself in purity— And prophesied the nāga’s supreme awakening:

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་ཅུ་རུ། །བྱམས་པ་བསྟེན་ནས་མ་འོངས་དུས་སུ་ནི། །རྒྱལ་བ་ཐུགས་དག་ཞེས་བྱ་དབང་པོ་བཏུལ། །ལྷ་དང་མི་དག་གིས་ནི་མཆོད་པར་འགྱུར། །
en: “Eighty quintillion eons from now, Due to your loving kindness, you will be a victor Known as Pure Mind, your senses subdued, Venerated by gods and men.”

source: མཆོག་ཏུ་དགའ་བ་རབ་ཏུ་མགུ་སེམས་ཀྱིས། །རྒྱལ་བའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། །ཚིགས་སུ་བཅད་པ་འདི་ཡིས་རྒྱལ་བ་བསྟོད། །
en: Overjoyed, his mind elated, He bowed his head at the feet of the Victor, And praised the Victor with these verses:

source: རབ་ཏུ་ཐུགས་དག་ནོངས་པ་ཤིན་ཏུ་བཏུལ། །
en: “In your utterly pure mind all faults are totally subdued.

source: གཏི་མུག་རྣམ་པར་བཅོམ་ཞིང་བདུད་ལས་རྒྱལ། །
en: You have conquered delusion and vanquished Māra.

source: སེམས་ཅན་ཀུན་ལ་ཕན་པའི་ཐུགས་རྗེ་ཅན། །
en: You have the compassion to benefit all sentient beings, And

source: ཉེས་པའི་དུག་སྤངས་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: you have forsaken the poison of wrongdoing—homage to you!”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་རྒྱགས་པས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Totally Haughty asked the Blessed One in the form of a song in verse:

source: སྤྱད་པ་སྤྱོད་པའི་ཚེ་ན་ཐབས་གང་གིས། །བདུད་ཀྱི་སྤྱོད་ཡུལ་དབང་དུ་མི་འགྱུར་ཞིང་། །སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ནི་བསྲུངས་འགྱུར་བ། །བདེ་གཤེགས་ཐུབ་ཆེན་སངས་རྒྱས་ལ་ཞུའོ། །
en: “What method should one use when practicing So as not to fall under the sway of the realm of Māra, But be protected by all the buddhas? O Blissful One, great sage—O Buddha, I ask this of you!”

source: རྒྱལ་བས་དེ་ཡི་བསམ་པ་མཁྱེན་པ་ན། །ཆགས་མེད་ཡེ་ཤེས་ཀུན་ཏུ་སྤྱན་མངའ་བ། །བསོད་ནམས་བརྒྱ་མཚན་ཕན་པའི་ཐུགས་རྗེ་ཅན། །སངས་རྒྱས་སྟོབས་ལ་མཁས་པས་ལུང་བསྟན་པ། །
en: The Victor was aware of his thoughts, And so with his all-seeing wisdom free of attachment, His hundred marks of merit, and his altruistic compassion, The Buddha, skilled in power, replied,

source: རྟག་ཏུ་དེ་ནི་དྲན་པ་ཉེར་གཞག་ནཉོན་མོངས་བདུད་ཀྱི་དབང་དུ་བྱ་བ་མེད། །
en: “If you constantly apply mindfulness, You will not fall under the sway of affliction and Māra.

source: རྟག་ཏུ་རྣམ་དག་སེམས་ཀྱིས་དྲན་སྤྱོད་ན། །དེས་ན་བདུད་ཀྱི་དབང་དུ་དེ་མི་འཁྲིད། །
en: If you constantly practice mindfulness with purity of mind, Then you will not be led into the influence of Māra.”

source: རྒྱལ་བས་ལེགས་གསུངས་ཚིག་དེ་ཐོས་ནས་སུ། །སྟོན་པའི་གསུང་གིས་ཀླུ་དེ་དགའ་གྱུར་ནས། །
en: Hearing the Victor’s excellent speech, The nāga was delighted by the Teacher’s words.

source: རབ་ཏུ་སེམས་དང་ཚིག་ནི་གཙང་བ་དང་། །མ་སྨད་པ་ཡིས་བདེ་གཤེགས་མངོན་པར་བསྟོད། །
en: He praised the Blissful One with a clear mind And pure and irreproachable language:

source: སྲིད་པའི་སྐྱེ་ལ་རྒྱལ་བ་ཐུགས་བརྩེ་ལྡན། །
en: “You have conquered birth in existence and are full of love.

source: སེམས་ཅན་ལམ་ངན་རབ་ཞུགས་གཟིགས་ནས་སུ། །ཐེ་ཙོམ་སེལ་ཅིང་ཡོངས་སུ་དགྱེས་ཐུགས་ཀྱིས། །རྒྱལ་བས་བསྟན་པའི་ལམ་ལ་སེམས་ཅན་རྣམས། །
en: Perceiving how beings are following bad paths, You eliminate doubt and with a joyful mind Lead beings onto the path prescribed by the victors.

source: ཁྱོད་ཀྱིས་ལེགས་གསུངས་ཚིག་ནི་ཐོས་ནས་སུ། །རྒྱལ་བའི་ཆོས་བཙལ་སྤྱོད་པ་སྤྱད་པར་བགྱི། །
en: “Hearing these words, I vow To practice in pursuit of the Victor’s teachings.

source: བདུད་ཀྱི་སྟོབས་བཅས་དཔུང་བཅས་བཅོམ་ནས་སུ། །སྡུག་བསྔལ་ཆོས་གྲོལ་སངས་རྒྱས་འགྱུར་བར་བགྱི། །
en: I will conquer the forces and legions of Māra, Become free from the phenomena of suffering, and reach buddhahood.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཆར་ཆེན་པོ་སྤྱོད་པ་ཞེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: Then the nāga king Causing Downpour asked the Blessed One in the form of a song in verse:

source: སྐྱེ་དགུ་དག་ལ་བྱམས་ཐུགས་སྐྱབས་ཀྱི་མཆོག །ཀུན་དུ་སྤྱན་མངའ་རྒྱལ་མཆོག་ཐུགས་རྗེ་ཅན། །རྡུལ་བྲལ་བྱང་ཆུབ་ལ་ནི་ཇི་ལྟར་སྤྱད། །
en: “Supreme and loving refuge of beings, All-seeing , compassionate, eminent Victor, How should one practice toward flawless awakening?

source: སྟོབས་བཅུ་ཡེ་ཤེས་ཕུང་པོ་ཁྱོད་ལ་ཞུ། །
en: With your assemblage of ten powers and wisdom, I beseech you:

source: འཇིག་རྟེན་མགོན་པོ་བདག་གི་ཐེ་ཚོམ་ཁུམ། །
en: “O Protector of the World, please extinguish my doubts!”

source: འགྲོ་བ་ཀུན་གྱི་བསམ་པ་རྣམ་པར་མཁྱེན། །བདེ་བར་གཤེགས་པས་ཀླུ་དེ་དགའ་གྱུར་ནས། །
en: Aware of the thoughts of all beings, The Blissful One delighted the nāga,

source: རང་སེམས་ཤེས་པར་བྱ་ཕྱིར་བརྩོན་འགྲུས་བརྟན། །ཇི་ལྟར་བདེ་བར་གཤེགས་པས་བསྟན་ལྟར་བསླབས། །
en: “To understand your mind, train in steady diligence, Just as the Blissful One has taught.

source: རང་སེམས་ཤེས་པར་བྱ་ཕྱིར་ངེས་པར་གྱུར། །
en: To understand your mind, gain conviction.”

source: རྒྱལ་བས་བསྟན་པའི་ལམ་ནི་ཐོས་ནས་འདུག །
en: Hearing of the path taught by the Victor, he remained there,

source: ཡོངས་སུ་མགུ་བའི་ཡིད་ཀྱིས་ཐེ་ཙོམ་བསལ། །
en: His mind elated, having removed all doubt.

source: དགའ་བས་ས་ལ་པུས་མོ་བཙུགས་ནས་སུ། །རྣམ་འདྲེན་འཇིག་རྟེན་ཕན་མཛད་མངོན་བསྟོད་པ། །
en: With joy he knelt on the ground And praised the Guide who benefits the world:

source: ཉོན་མོངས་ཐམས་ཅད་བསལ་བ་བླ་ན་མེད། །ཁྱོད་འདྲ་མ་མཆིས་གོང་ན་ག་ལ་མཆིས། །
en: “Having eliminated all affliction, you are unsurpassed. There is no one like you, let alone superior.

source: མ་སྨད་སེམས་ཅན་ཡིད་ནི་དགའ་བར་མཛད། །
en: You delight the minds of beings irreproachably—

source: བདེ་གཤེགས་བྱང་ཆུབ་མི་བཟད་ཕྱག་འཚལ་ལོ། །
en: Blissful One, homage to your tremendous awakening!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོ་དེ་དག་ཐམས་ཅད་ཀྱི་བསམ་པ་མཁྱེན།
en: The Blessed One was aware of the thoughts of all these nāga kings.

source: ལས་ཀྱང་མཁྱེན།
en: He understood their karma and

source: སྨོན་ལམ་དག་ཀྱང་མཁྱེན་ཏེ།
en: he understood their aspirations.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་དོན་ཆེན་པོ་མཛད་ནས། །དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Having benefitted the whole world including gods, humans, and demigods greatly, he then said to the monks,

source: དགེ་སློང་དག་ལྟོས་ཤིག །
en: “Behold, O monks.

source: ཀླུའི་རྒྱལ་པོ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལས་འདུལ་བ་ཐོས་ནས། །
en: After these nāga kings heard the Discipline from the Thus-Gone One,

source: འདུལ་བའི་རྟགས་དག་སྟོན་པར་བྱེད།
en: they display signs of discipline.
